import os
import json
from dotenv import load_dotenv
from openai import OpenAI
from pydantic import BaseModel
from concurrent.futures import ThreadPoolExecutor
import time

load_dotenv()
api_key = os.getenv("OpenAI_api_key")

if not api_key:
    raise ValueError("Ключ OPENAI_API_KEY не знайдено! Перевір файл .env")

client = OpenAI(api_key=api_key)


class Message(BaseModel):
    role: str
    text: str


class DialogueResponse(BaseModel):
    dialogue: list[Message]


intents = [
    "проблеми з оплатою",
    "доступ до акаунту",
    "технічні помилки",
    "повернення коштів",
    "питання по тарифу"
]
scenario_instructions = {
    "???успішний кейс": """Клієнт чітко розуміє проблему ('хочу перейти на новий тариф'), а агент швидко та 
    професійно йому допомагає. Клієнт залишається задоволеним.""",

    "прихована незадоволеність": """Агент не вирішує проблему. Клієнт розуміє, що сперечатися марно, тому 
    в кінці ввічливо, але сухо дякує і прощається.""",

    "конфліктний кейс": """Клієнт дуже нервовий або роздратований. Наприклад: каже, що боїться електрики, 
    тому не буде чіпати роутер, і вимагає майстра додому. Агент намагається його заспокоїти, однак клієнт
    починає агресувати.""",

    "помилка агента": """Агент веде себе нетактовно. Не вітається, показує своє роздратування, може сказати, 
    що клієнт тупий, або розказує особисту чи конфіденційну інформацію. Відбувається сварка.""",

    "незрозуміла проблема": """Клієнт не розуміє суть проблеми. Наприклад: 'вітаю у всіх нема інтернету? 
    Мені потрібно подзвонити дружині'. Або клієнт наляканий тим, що профіль безслідно зник, але насправді 
    зробив одруківку в пошті (@gmai.com). Агент старається допомогти навідними запитаннями."""
}

dataset = []


def generate_dialogue(intent, scenario):
    detailed_instruction = scenario_instructions[scenario]

    prompt = f"""
        Ти — експерт зі створення навчальних датасетів.
        Напиши реалістичний діалог між клієнтом та агентом служби підтримки компанії КАРИБО. 
        "Реалістичний" - означає,що може відігравати людський фактор: іноді люди самі не розуміють, 
        яка в них проблема, можуть дратуватись або бути спокійними.

        Тема звернення: {intent}.

        ТВІЙ СЦЕНАРІЙ ДЛЯ ЦЬОГО ДІАЛОГУ (СТРОГО ДОТРИМУЙСЯ ЙОГО):
        {detailed_instruction}

        БАЗОВІ ПРАВИЛА (ВИКОНУЙ ЗАВЖДИ):
        1. ЖИВА МОВА КЛІЄНТА: Клієнт пише як звичайна людина. Іноді використовуй сленг, відсутність граматики 
        чи розділових знаків, роби одруківки.
        2. ПОВЕДІНКА АГЕНТА (ЯКЩО В СЦЕНАРІЇ НЕ ВКАЗАНО ІНШЕ): Агент професійний, але живий. Обов'язково 
        починає з привітання (наприклад: "Вітаю, на зв'язку Максим, оператор техпідтримки КАРИБО. Підкажіть, 
        як до Вас можна звертатись?"). Завжди ввічливо закінчує діалог, навіть якщо не зміг допомогти.
        3. ФОРМАТ: 4-7 реплік. Мова — українська.
        """

    print(f"⏳ Генерую: {intent} + {scenario}...")

    try:
        response = client.beta.chat.completions.parse(
            model = "gpt-4o-mini",
            messages = [
                {"role": "system", "content": "Ти помічник, який генерує датасети діалогів підтримки."},
                {"role": "user", "content": prompt}
            ],
            response_format = DialogueResponse,
            temperature = 0.0,
            seed = 13
        )

        result = response.choices[0].message.parsed.model_dump()
        result["intent"] = intent
        result["scenario"] = scenario_key

        return result

    except Exception as e:
        print(f"❌ Помилка генерації {intent} + {scenario_key}: {e}")
        return None

if __name__ == "__main__":
    start_time = time.time()

    print("🚀 Починаємо створення датасету...")
    dataset = []
    tasks = []

    for intent in intents:
        for scenario_key in scenario_instructions.keys():
            tasks.append((intent, scenario_key))

    with ThreadPoolExecutor(max_workers=15) as executor:
        results = executor.map(lambda x: generate_dialogue(x[0], x[1]), tasks)

    for res in results:
        if res:
            dataset.append(res)

    with open("dataset.json", "w", encoding="utf-8") as file:
        json.dump(dataset, file, ensure_ascii=False, indent=4)

    time_end = time.time()
    time_full = time_end - start_time
    print(f"🎉 Готово! Збережено {len(dataset)} діалогів у dataset.json.")
    print(f"⏱ Час виконання: {time_full:.2f} сек")